// pages/news/news.js
Page({
  data: {
    newslist: [
      {
        "id": "1",
        "title": "第四届“金交会”：建行推出银联音频卡",
        "time": "2015-06-26 17:37:26",
        "profile": "国际在线广东频道消息：2015年6月26日，第四届中国（广州）国际金融交易博览会在广州市海珠区琶洲会展中心盛大启动。在中国建设银行的展区，笔者看到各式各样针对移动端的移动支付产品及网银安全工具。有一款建行音频卡，可以让银行卡“发声”，为自己“代言”，受到普遍关注，吸引了不少参展人员前来咨询和围观。",
        "imgurl": "/images/news/new1_2.jpg"
      }, {
        "id": "2",
        "title": "奇龙网与银联即将联合发行的会发声银行卡",
        "time": "2016-08-22 11:35",
        "profile": "奇龙网与深圳前海卓智长天科技有限公司（以下简称：卓智长天）达成战略合作，将与银行共同推出一张会发“声”的银行卡——银联音频卡（以下简称：音频卡），以满足用户在互联网新时代的不同支付需求，为用户提供更为快捷、方便、安全的线上线下支付体验。",
        "imgurl": "/images/swiper_1.jpg"
      }
    ]
  },
  onLoad: function (options) {
    // 页面初始化 options为页面跳转所带来的参数
  },
  onReady: function () {
    // 页面渲染完成
  },
  onShow: function () {
    // 页面显示
  },
  onHide: function () {
    // 页面隐藏
  },
  onUnload: function () {
    // 页面关闭
  }
})